src/BusinessProcesses/СогласованиеАрхитектуры/СогласованиеАрхитектуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>СогласованиеАрхитектуры</name>
  <task>Task.ЗадачаИсполнителя</task>
  <attributes>
    <name>ЗадачаМетеор</name>
    <type>
      <types>CatalogRef.ЗадачиМетеор</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано</name>
    <comment>Результат согласования</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗамечаниеHTML_СогласоватьАрхитектуру</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗамечаниехзВложения_СогласоватьАрхитектуру</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Разработчик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

src/InformationRegisters/СледующиеЭтапыЗадачиПоТочкеМаршрута/СледующиеЭтапыЗадачиПоТочкеМаршрута.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СледующиеЭтапыЗадачиПоТочкеМаршрута</name>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>BusinessProcessRoutePointRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.ЭтапыЗадачиМетеор</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/BusinessProcesses/СогласованиеАрхитектуры/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытийКартыМаршрута

Процедура ПеревестиНаСледующийЭтапПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	Если Не ИнтеграцияСМетеор.ПроверитьТекущийЭтапЗадачиВМетеоре(ЗадачаМетеор, Справочники.ЭтапыЗадачиМетеор.СогласоватьАрхитектуру) Тогда
		Возврат;
	КонецЕсли;
	
	Этапы = РегистрыСведений.СледующиеЭтапыЗадачиПоТочкеМаршрута.ПолучитьЭтапыПоТочкеМаршрута(
		Бизнеспроцессы.СогласованиеАрхитектуры.ТочкиМаршрута.ПеревестиНаСледующийЭтап,
		Согласовано);
	ИнтеграцияСМетеор.ПеревестиЗадачуНаЭтапВМетеоре(ЗадачаМетеор, Этапы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийМодуля

#КонецОбласти

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
